{"business_units": [{"response": [{"reviews": [{"category": "VPN Service", "rating": "5.0", "reviewed_at": "21/12/2015", "review_title": "Number one", "service_name": "Expressvpn", "reviewer_name": "Melissa", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "The absolute best reason I use BlueHost is the TECH SUPPORT! I always, every time get a guy who speaks English, and understands my issue from the first time I explain it, they politely ask the questions to find my issue (even if I don’t know what I am talking about lol), they stay on the phone with me until the issue is solved and they give excellent advice and recommendations on other things I might be interested in to make things work better. I also learn a lot from them! Definitely number one in hosting services.", "picture_urls": ""}, {"category": "VPN Service", "rating": "4.8", "reviewed_at": "09/12/2015", "review_title": "Patience pays off", "service_name": "Expressvpn", "reviewer_name": "Deirdre", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "I joined with bluehost since they started with dedicated servers. In the beginning there were quite a few issues and they needed sorting out however now it is plain awesome. My server is almost never down, support is always available and since I am based in a different time zone the online chat support is super important. When you add to this the great CDN integration that makes sure to keep all the sites online it is simply outstanding. Sometimes you have to be patient when companies are going through change, and if you are it really pays off!", "picture_urls": ""}, {"category": "VPN Service", "rating": "2.4", "reviewed_at": "09/12/2015", "review_title": "Don't sign with Bluehost", "service_name": "Expressvpn", "reviewer_name": "Christopher", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "Bluehost sucks!!! The performance is awful. Our site hosted by them used to be offline for at least half an hour every week. They blocked out SMTP and now anything I need they make you pay extra for VPS. Just so they can make more money! 4 years ago they were so much better before they started offering the VPS and dedicated options. Sometimes people are more important than money. When you become greedy people will leave and they will have less money. If they invest in their clients more people will join and they will have more money.", "picture_urls": ""}, {"category": "VPN Service", "rating": "5.0", "reviewed_at": "09/12/2015", "review_title": "Great company", "service_name": "Expressvpn", "reviewer_name": "Erin", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "I have been hosting with BlueHost for over a year. After being with several other hosting companies I have to say that BlueHost is one of the top hosting providers. Whenever I have a question or need help their technical support team is always available. They answer immediately and they speak proper English. It is very important to know that you are dealing with a company that provides excellent customer support. Since I have signed up with BlueHost everything has been working perfectly. The service is very good and I’m proud to be one of their customers", "picture_urls": ""}, {"category": "VPN Service", "rating": "4.2", "reviewed_at": "09/12/2015", "review_title": "Average", "service_name": "Expressvpn", "reviewer_name": "Hank S.", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "My feelings about BlueHost are that they are average. I pay about ten dollars a month now since I finished the first year on shared hosting. I don’t think that the service justifies the price. The uptime and loading time is very inconsistent. It goes from 3-9 seconds at different times in the day. The technical support doesn’t seem to worry about this and they think it is regular. I would prefer better service. I guess I should start shopping around. I just don’t feel like going through the transfer again.", "picture_urls": ""}, {"category": "VPN Service", "rating": "4.6", "reviewed_at": "25/11/2015", "review_title": "fast load but site crashes", "service_name": "Expressvpn", "reviewer_name": "Timothy", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "My sites load fast on Bluehost which is crucial for my google rankings, however lately my site has been crashing quite a bit. I know that because I have shared hosting it can’t be perfect but this is pretty bad. The tech support was actually very sympathetic and really want ed to help which made me feel better, but of course they tried to convince me to upgrade. If the prices were cheaper I would get dedicated hosting but for now it is not relevant for me. I wonder if all the web hosting companies do the same….", "picture_urls": ""}, {"category": "VPN Service", "rating": "4.2", "reviewed_at": "25/11/2015", "review_title": "Need less downtime.", "service_name": "Expressvpn", "reviewer_name": "Patricia", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "As a web developer I need great hosting for my customers websites. Unfortunately there is a lot of downtime on BlueHost, it seems like they are doing their maintenance during business hours and that sucks. I have a large account with them- a reseller account. I have been with them for years and I am really happy with the service but if this keeps up I will have to look for other solutions. I have tried talking to them about this but it doesn’t seem like they are taking care of the issue. Hoping for better uptime.", "picture_urls": ""}, {"category": "VPN Service", "rating": "5.0", "reviewed_at": "24/11/2015", "review_title": "Very easy set up.", "service_name": "Expressvpn", "reviewer_name": "Jamie", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "I am fairly new to BlueHost and so far I am really satisfied. The sign up process was very simple and everything was very clear and straight forward. The customer service helped me immensely getting everything set up and I really did not need them that much. I can’t really say a lot since I am pretty new to BlueHost but I think that the fact that the employees are so friendly and helpful and it was so easy to set up says a lot already. I think they will be great for me and I am sure for many others starting out.", "picture_urls": ""}, {"category": "VPN Service", "rating": "4.2", "reviewed_at": "24/11/2015", "review_title": "Bad security", "service_name": "Expressvpn", "reviewer_name": "Federica", "absolute_url": "http://pickuphost.com/review/bluehost/", "website_name": "pickuphost", "review_text": "When I was shopping around for a hosting service I read really great comments about BlueHost- apparently they are the most reliable. I’m not so sure about that anymore! I don’t know what I need to do to get some decent service. Because of hacking issues my sites were down a few times in the past month- and not only mine! A whole bunch of their clients were affected by this. They said that they can’t guarantee uptime when it comes to security problems. I actually said to them that they should upgrade their security.", "picture_urls": ""}], "business_item_data": {"category": "VPN Service", "sub_category": "", "original_price": "", "specifications": [], "website_name": "Expressvpn", "availability": "", "picture_urls": [], "business_type": "Service", "name": "Expressvpn-VPN Service", "absolute_url": "http://pickuphost.com/review/bluehost/", "description": "", "sale_price": ""}}], "scrapping_website_url": "http://pickuphost.com/review/bluehost/", "scrapping_website_name": "Expressvpn"}]}