{"business_units": [{"scrapping_website_name": "Bluehost", "scrapping_website_url": "https://www.sitejabber.com/reviews/expressvpn.com", "response": [{"business_item_data": {"business_type": "Service", "absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "category": "Hosting Service", "name": "Bluehost-Hosting Service", "sub_category": "", "picture_urls": [], "original_price": "Service", "sale_price": "", "availability": "", "specifications": "Service", "website_name": "Bluehost", "description": ""}, "reviews": [{"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "0.0", "review_title": "“Unreliable and slow; false advertising”", "reviewed_at": "06/04/2018", "reviewer_name": "Scott A.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I bought a trial version of ExpressVPN (EVPN) a year ago before taking a job outside the US. During the short trial period EVPN seemed to be work fine. But once I got overseas, the proverbial crap hit the fan. When EVPN worked, my machines were very slow. And the connection would fail every few minutes. Even though I never connected the VPN kill-switch, when the VPN was down and struggling to connect, I couldnt connect to the Internet at all. It was so consistently bad that Internet use became unpredictable. I actually had to return to the US after only 6 months BECAUSE I couldnt do my work. Others who were using EVPN throughout the country were experiencing the same problem. \n\nNow Im back in the States and EVPN still throughout the day fails. Its typical for me to look at its icon in my system tray and see its NOT connected, obviating the very protection Im paying for. And its worse on my mobile phone. Its CONSTANTLY down. And when its active, my phone is so slow I cant load even just a webpage. \n\nWorst of all, the company doesnt care about these experiences. When you contact customer support, you get the same insipid trouble shooting instructions. If you try to tell them youve tried the steps before without any improvement, theyll tell you you havent. Then when you send them the files showing that youve already done what theyve instructed, the communication will go dead. \n\nAnd Ive tried EVERY server, but Netflix eventually denies them all despite EVPNs claim you can use them with Netflix. I have trouble using EVPN with other sites, too, like Craigslist. \n\nHow does this company keep turning up as the #1 VPN provider? Either their competitors are even worse or EVPN pays review companies for biased assessments.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "3.5", "review_title": "“Used up 1-100% of CPU (doing what?) in background”", "reviewed_at": "30/03/2018", "reviewer_name": "elliott a.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Service itself was as advertised, however:\r\nI detected over 100% CPU usage (from overclocking) by programme \"expressvpnd\". Of course I made sure that I was disconnected and I tried rebooting. The very high usage of CPU persisted (it was intermittent, but remained), and at all times appeared in my top 10 programmes running. I uninstalled, and the problem went away. Today I tried reinstalling (with a new download of their website) to see if the problem was with the original install: The problem returned.\n\nThis is completely unacceptable, and highly suspicious. Want to protect your privacy? maybe first check that ExpressVPN isn't a form of spyware itself - or perhaps using customers' CPUs to mine cryptocurrencies. Who knows, but it's not worth the risk, the money, nor the massive cost on CPU.\n\nI was using the linux 64 version, on Ubuntu 16.04, Dell Inspiron 15z 5579, i7-8550U.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "4.1", "review_title": "“I didn`t receive my money back, though I have requested weeks ago”", "reviewed_at": "12/03/2018", "reviewer_name": "Luiz S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I didn't receive my money back though I have requested weeks ago. I'nm very disappointed with your services. My favorite server (Italy) never works fine and connection always dropped randomly. I'm very disappointed.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "3.7", "review_title": "“Stable connection and it really unblocks websites”", "reviewed_at": "01/03/2018", "reviewer_name": "Cora M.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I'm full time online freelancer and found out about ExpressVPN through some great reviews from a Facebook group I joined.I decided to jump in and make the move to paid VPN services. It was the best decision I made. I am truly grateful for my secure online browsing. Thank you, ExpressVPN!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "3.5", "review_title": "“SCAM!! Money Back Guarantee,30 Days Free”", "reviewed_at": "08/02/2018", "reviewer_name": "Prima R.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I registered in Nov./17 for a monthly plan, $12.95 using Paypal, thinking I will try it, and if not satisfied, I will cancel before the 30 day free period ends.  I actually cancelled 4 DAYS later because speed was extremely slow when connected to ExpressVPN. I followed the instructions on their site exactly \"How to Cancel Your ExpressVPN Subscription\".  It tells you to select \"Turn automatic renewal OFF and cancel my service on the expiration date\" in your account settings. Also says \"Your subscription will be canceled and you will not be billed at the end of your subscription cycle.\"  I immediately received an email from my Paypal saying \"ExpressVPN has suspended your automatic payments!\" *****And this is where the SCAM begins!*****\r\n1 month later (or 34 days after I initially registered) I contacted ExpressVPN live chat to ask why they had not refunded my $12.95 back to my PayPal account?\n\nChat response: (taken from actual chat log)\r\nVisitor: I paid $12.95 for 30 day trial...cancelled before the 30 day end but...didn't receive my refund?? \r\nGene: We have not received any request from you to cancel the subscription and receive a refund. No records on your account is saying that you requested a refund or a cancel.\r\nVisitor: the date I cancelled was Nov 29th \r\nVisitor: 4 DAYS AFTER INITIAL REGISTRATION\n\nI decided to forward to them the email I received from my PayPal stating that \"ExpressVPN has suspended your automatic payments\" so CLEARLY they were aware of my cancellation! Just not going to admit it!\n\nChat response:\r\nGene: I have the info on my end saying you cancelled the pre-approved payments. \r\nVisitor: I followed your instructions exactly on your wesite \"how to cancel your subscription\" \r\nVisitor: i signed into my expressvpn account... \r\nVisitor: located \"automatic renewal section\" \r\nVisitor: manage settings... \r\nGene: Check the email you forwarded again. It says \" ExpressVPN has suspended your automatic payments\" \r\nVisitor: and as per your website instructions...\"turn automatic renewal OFF and cancel my service \" \r\nGene: Meaning we did not revoked or cancelled the subscription but we turned off the automatic renewal only since you disabled your \"Paypal's Pre-Approved Payments\" \r\nVisitor: YES !!! AGAIN ...for the 5th time...why would express vpn suspend my subscription 4days after registering?? \r\nVisitor: why??? why??? why??? \r\nVisitor: if I didnt cancel??\n\nHe told me unfortunately I was beyond the 30 day money back guarantee, and added \"You cancelled from your mode of payment but not with us.\" (even though I used their own website!)\r\nFortunately for me, $12.95 is a small amount of money BUT multiplied by thousands of other fish like myself who bit on their hook, can be a lot for them!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "3.8", "review_title": "“If VPN's were turds, this would be the size of a dinosaur turd”", "reviewed_at": "05/02/2018", "reviewer_name": "Scott N.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "This supposed \"unblockable\" vpn is always blocked.  Don't let them fool you.  I've been in China for two years and this one is no better than the rest for getting past \"The Great Firewall\" of China.   Personally, I've had better luck with a free vpn that always (ALWAYS) works.  And when this one actually worked, it was no faster than any other vpn. These guys are only after your money.  Pure and simple.  And their customer support is non-existent once they have you signed up.  And never, repeat N-E-V-E-R sign up for a 30 day free trial for anything.  Especially these crooks.  Run fast.  Run far.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "3.9", "review_title": "“finally service worth of my money.”", "reviewed_at": "01/02/2018", "reviewer_name": "Walker B.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Thank you ExpressVPN for giving me the best VPN services I ever had. I tried several services in the past and I never really felt secure. I also tried a paid service from another VPN provider just last year only to find out that there's still some sort of leakage. Been using ExpressVPN for two months now and I never had any similar problems. Thank you so much because I finally found the best service for me.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "0.0", "review_title": "“Careful with payments, Refunds are sketchy...”", "reviewed_at": "11/12/2017", "reviewer_name": "Haz M.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "By mistake I renewed my subscription for 1 year period and was charged $99.-. After 3 weeks their Customer service chat told me it is already refunded to my account but it is not in my account and they want you to believe them, no receipt, no refund number, nothing.\n\nI am not renewing my account with them. I thought they were serious bussiness. WATCH IT!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“\"ONE MONTH FREE TRIAL\" - VERY DISAPPOINTED CUSTOMER”", "reviewed_at": "05/12/2017", "reviewer_name": "cecily c.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I subscribed for a one month free trial of Express VPN in November 2017. I cancelled the free trial within the month. It is now 7th December 2017 and   Express VPN has charged my account for US$12.95 on separate 3 occasions. I have tried to contact their \"instant\" Live Chat Support. I have not received any response.  I have since cancelled my credit card in order to stop Express VPN from charging me further.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "2.0", "review_title": "“Unblocks content in school”", "reviewed_at": "23/10/2017", "reviewer_name": "Poppie G.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I bought ExpressVPN to unblock Snapchat in school, becasue a friend told me VPNs are great for this. I only bought the 1 month plan to try it out. So far its been fast and very reliable. Will get 12month plan once I have the dollars.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“Protection at the first place”", "reviewed_at": "27/09/2017", "reviewer_name": "Nazer S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Didn't know what a VPN was until someone referred this app to me. So glad I decided to give it a try because it's totally changed the way I think about privacy.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "5.0", "review_title": "“Refund Hassle”", "reviewed_at": "27/09/2017", "reviewer_name": "Michael D.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Despite being within the \"30 day free trial period\" three email requests to remove a 1-yr subscription charge to our credit card were ignored. Out of frustration I contacted our credit card folks and requested a \"chargeback\" against ExpressVPN and also sent a 4th email to ExpressVPN  this one with the header \"Without Prejudice\". Six hours later the charge was refunded.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“Works very well.”", "reviewed_at": "17/09/2017", "reviewer_name": "Jakow W.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Downloaded Express a few months ago and have so far referred 3 people. Loving this app. Excellent Customer servis.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“Now they need an app for robots”", "reviewed_at": "15/09/2017", "reviewer_name": "Ivan B.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "If I can protect my iphone this easily, I want protect my wireless robot. great network security", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“service I trust”", "reviewed_at": "04/09/2017", "reviewer_name": "Wade S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Great app with a really nice layout. Selecting server is really simple and the network lock protects my privacy even when i'm disconnected. Highly recommended.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“EXPRESS VPN IS THE VERY BEST”", "reviewed_at": "28/08/2017", "reviewer_name": "marit h.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I can just contact them once by chat or email and I get an instant response\r\nand every problem I had was resolved\r\neven though last time I could not be helped at once - they kept sending me emails  as a follow up and in 1 day my problem was solved\r\nYou never feel they do not care about you\r\nThat is UNUSUAL CUSTOMER SERVICE\r\nThank you Express VPN\r\nSo GLAD I chose YOU\r\nMarit", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“Best fighters for privacy!”", "reviewed_at": "14/07/2017", "reviewer_name": "Michael L.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Wonderful service. I really love how active their are in the fight for privacy, all of the servers are very fast and very reliable.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“slow slow slow”", "reviewed_at": "10/07/2017", "reviewer_name": "Pietro S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "in the beginning was ok, but after two months , the speed is super slow I have to change server every day and chat with support to know which server work with netflix. very disappointed", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“No lag, works 100%”", "reviewed_at": "07/07/2017", "reviewer_name": "Andrej T.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Unlike other VPN apps, this one still works with Netflix, the customer support is very good to deal with.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "5.0", "review_title": "“Speed >5 ,Privacy >5 ,customer service >5”", "reviewed_at": "17/05/2017", "reviewer_name": "Olesen C.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Been using Express VPN for 2 years and am still a very happy customer. Keep it up with the good work.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“EXTREMELY SLOW WHEN CONNECTED WITH VPN”", "reviewed_at": "03/05/2017", "reviewer_name": "Joe F.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I have had expressVPN for 1yr now! (ONLY because I signed up for the 1 yr plan) I was mostly using ONLY the DNS servers  to stream, but when that quit working I was forced to purchase a new router (which they recommended, and advertised on their website) so I could use their VPN service... my speeds went down EXTREMELY LOW!!!! Sometimes by as much as a 90% loss!!!! I constantly argue and fight back and forth with them, only to get BS excuses in return! I do NOT feel they should be legally allowed to advertise as they do!!!! STAY AWAY!!!!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "1.0", "review_title": "“feels like home”", "reviewed_at": "19/04/2017", "reviewer_name": "Kiara M.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Solid app with Seller customer support. I am currently out of the US and I must say that having expressvpn feels like I never left home...everything is working.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "5.0", "review_title": "“Netflix works again!!!”", "reviewed_at": "19/04/2017", "reviewer_name": "Gael P.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Very satisfied ExpressVPN customers for almost a year now. I love being able to binge watch my very Netflix shows again.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "5.0", "review_title": "“A bit more money for far best service”", "reviewed_at": "06/04/2017", "reviewer_name": "Todd M.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Recently switched from a free service to ExpressVPN. Yes, the price is a little higher but you can definitely get your money's worth in terms of connection reliability and server choices.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com", "rating": "5.0", "review_title": "“express vpn/expressvpn so-so product horrible customer service”", "reviewed_at": "29/03/2017", "reviewer_name": "benjamin m.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "i have had it up to my neck with these people, so to save myself time, here is the final email i wrote these people, and it isn't good. never buy expressvpn services, and certainly never use a union pay card if you are ever crazy enough to chance it.\n\nso, its been a week and i have gotten no reply. just to review, i bought a month of your vpn service with a union pay card. i already had an account with you all, but you wouldnt let me change the card i had on file to union pay, so i had to open a whole new account with a new email. i went through the whole payment process only to find out after i paid that you did not have my email on file. i then spent hours talking to service reps online and waited two weeks for you all to figure out what the problem was. i sent you a bank statement proving i paid for service. i told you multiple times that the vpn worked on my phone and all i wanted was my activation code so i could use it on my lap top. well...enough is enough. i gave you a whole week to get back to me, and nothing. i guess either i or my money is meaningless to you. no one would have appreciated the run around i got, so true to my word i am writing a review of my experience this past month with you all, and it wont be good. i would demand my money back however you cant find the card i paid with, even after i showed you the statement! so now i have to go to union pay to stop all future auto debits. thank for the so-so service and the nightmareish fiasco you call customer service. \r\n\r\nbenjamin mould", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "0.0", "review_title": "“Perfect!”", "reviewed_at": "07/02/2017", "reviewer_name": "Anthony D.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Gets a spiffy 5 star from me! Downloaded the app and was able to install and connect to a VPN server in seconds.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.5", "review_title": "“Little more money for a lot better service”", "reviewed_at": "16/12/2016", "reviewer_name": "Anya G.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Switched from a free app to this one. Yes, I'm paying more but it's totally worth it for the better service.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "4.1", "review_title": "“Works with Netflix but I use it all the time”", "reviewed_at": "15/12/2016", "reviewer_name": "Mick H.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "At first we just downloaded this app to watch Netflix,but after reading about VPNs we've been turning in on every time we go online.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.7", "review_title": "“Stable and Trustworthy”", "reviewed_at": "13/11/2016", "reviewer_name": "Michael R.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Steller connection reliability. I've found that using express vpn even helps stabilize my connection when I'm gaming online.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.5", "review_title": "“Unlocks the world”", "reviewed_at": "05/11/2016", "reviewer_name": "Davor T.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Wonderful product and the customer support is outstanding. 5 stars!!!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.8", "review_title": "“The best&easy to use”", "reviewed_at": "04/11/2016", "reviewer_name": "Eron U.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Easily the best VPN around. They have apps for every device, and they're incredibly easy to use.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.9", "review_title": "“ExpressVPN-The Best VPN for China”", "reviewed_at": "21/10/2016", "reviewer_name": "Kate T.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I was told that for my trip in China I need to use a VPN to access all the foreign websites for my project, I stayed in mainland China and found that ExpressVPN provided me access to all the foreign websites that are blocked in China. I used its Hong Kong, Japan, and Los Angeles servers for better connection speed and minimum ping time. I found a bit expensive but since no other less pricey VPN works in China so I had no option. Overall my experience is good with ExpressVPN. The core features which I gathered from the website of ExpressVPN are;\r\n\r\nThe Points I liked:\r\nUnlimited Bandwidth with Ultra Speed\r\nEndless Server Switches\r\n99.99% Uptime\r\nProvides all VPN protocols OpenVPN (TCP, UDP), L2TP-IPsec, SSTP, and PPTP\r\nHigh-End Security with OpenVPN 256-bits\r\nZero log keeping policy of internet activities\r\n136+ servers in 87+ countries\r\nAmazing Referral Program which brings 30 days of free service on every sign-up\r\n30-Days Money Back Guarantee\r\n3 Simultaneous-login Option\r\n\r\nThe Point I dislike:\r\nNo Free Trial Offer\r\nA little Pricey", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "0.0", "review_title": "“inconsistent”", "reviewed_at": "15/10/2016", "reviewer_name": "Jimmy K.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "My speed was never what the built in speed test said.  Often as little as 20%.  Connection can be fast at times but usually quite slow, and you have to spend most of your day hopping from server to server to find one that works.  Also the speed test takes forever since it forces you to go through their entire list of servers one at a time, most of which are pointless and slow.  They should have a feature where you could just test a list of favorite servers.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“how did the come up with this?”", "reviewed_at": "06/10/2016", "reviewer_name": "Iker G.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "great app, simple, interface, wonder what there brainstorming process is", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“SO many VPN locations”", "reviewed_at": "06/10/2016", "reviewer_name": "Freich G.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "ExpressVPN has servers pretty much everywhere but timbucktoo. impressive", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“Huge ExpressVPN fan”", "reviewed_at": "21/09/2016", "reviewer_name": "Nich E.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Got my whole dorm room using it", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“Totally Not Worth It”", "reviewed_at": "09/09/2016", "reviewer_name": "Derrick T.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I am living in china and had use expressvpn before. I stop my subscribtion once the 6 months period was up. With the expensive price, the quality, speed and connection provided was very poor. Its a waste of money and time. Please be aware that once u signed up, your account is automatically renew once your subscription expired. You have to manually set your account to \"off automatic renewal\" if not expressvpn will keep charging u. This is somewhat like a scam. Considering others much cheaper vpn available in the market with much better performance, especially those VPN that had been established for many years i.e. Witopia and etc, do not even consider expressvpn. In addition, expressvpn spend lots of money on advertising in the internet to get more new customers but While not really providing service that they promised. Again its somewhat like a scam or sort of used car salesman tactic.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“Too many disconnects.”", "reviewed_at": "29/08/2016", "reviewer_name": "Ray S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Disconnects a lot. Also, it's a bit slower than I would have hope since it was touted as being very fast.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“Thank ExpressVPN!!!!!”", "reviewed_at": "19/08/2016", "reviewer_name": "Gray B.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Great connections from Thailand!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“expressvpn SUCKS dont get it”", "reviewed_at": "15/08/2016", "reviewer_name": "Mick M.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I want my money back you are a bunch of scammers.I am seeking legal advise", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "4.0", "review_title": "“Wow, ExpressVPN!”", "reviewed_at": "11/08/2016", "reviewer_name": "Mason P.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "so good! can't thank so much enough!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "4.0", "review_title": "“expressvpn saved my vacation”", "reviewed_at": "08/08/2016", "reviewer_name": "Ross F.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I was on in grenada and my bf was being a dip$#*! so I just went to binge on netflix but I couldn't. expressvpn saved my sanity.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "3.0", "review_title": "“SCAMMERS”", "reviewed_at": "06/08/2016", "reviewer_name": "Jeremy R.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "These guys s!!ck they just told my money and refuses to give it back     they even went as far as to    make up a fake statement after they as for my master statement    motherf&&ckers", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "4.0", "review_title": "“MyBestBuyVPN”", "reviewed_at": "17/07/2016", "reviewer_name": "Richard S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I am using express for an three months now and I must say it is far the best vpn I've tried. True that express is a bit expensive but it is worth. Also servers are 99% up and running and you do not lose to much speed when you are connected.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“Will steal your money and not give it back”", "reviewed_at": "23/03/2016", "reviewer_name": "Xocoa S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "This company stole $99.95 USD from me without my consent through Paypal for a service I haven't used in 2 years.  Paypal sided with them and put in the transaction anyway despite my contacting ExpressVPN to cancel my account.  ExpressVPN promised to refund me the money and said they did, but they didn't.  So I made a complaint to Paypal again and I have to keep contacting them and receive more lies and excuses from them not to pay me back because I \"put in another dispute\".  I have to take legal action.  AVOID!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "1.0", "review_title": "“Not easy to get refund”", "reviewed_at": "01/11/2015", "reviewer_name": "pat c.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I wanted to use it for Hulu in Mexico but Hulu rejected them.  I asked for a refund the first day. They promised a 30 day money back guarantee however there is no  place on their site to request a refund.  It must be done manually via an email or online chat and then it takes 5 to 7 business days.  It is a hassle.  I feel ripped off.   Stay away from ExpressVPN.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "4.0", "review_title": "“great service”", "reviewed_at": "14/10/2015", "reviewer_name": "ahmad a.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "amazing software from expressvpn\r\nhttps://www.vpntorrents.com/expressvpn-review", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "1.0", "review_title": "“Virus or Malware”", "reviewed_at": "20/09/2015", "reviewer_name": "MR U.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "So I subscribed to this service with the highest of hopes but once providing my credit card info, downloading and installing their software, I was immediately displeased when the activation code they sent me came up as invalid or expired. I also was no longer able to access the internet on the computer I installed their software on. I contacted customer service via my other computer. They did respond saying that their activation server was having issues and to try back in a few hours. Well, I tried for 5 hours, deleted the software, reset my router, reset my wifi username and password, before contacting Mr. Able at customer service. After an hour of him telling me to contact my ISP, even though I told him I could still connect the internet via WIFI on my Iphone, Ipad, and other Imac he insisted it was an issue that I should take up with my ISP and disconnected from chat. This is the first review I have ever written and I have yet to see if they will actually live up to their 30 day money back guarantee \"no questions asked\". Its a virus or other malware, beware!!!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "1.0", "review_title": "“Nice”", "reviewed_at": "24/08/2015", "reviewer_name": "William K.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I currently have a year plan at expressvpn and I'll tell you a little about my experience with them.\r\nI primarily went with expressvpn because it was on a very nice sale (33~ euros for a year) and it had OK reviews. The features that I wanted in a VPN service was: proper privacy, simultaneous use on multiple devices, nice Windows interface with low system resource usage, Android app, torrenting allowed and can't remember anything more.\r\nWhat I like about expressvpn the most is that's it's pretty speedy and it has servers all around the world. The Windows client supports the usual VPN protocols including OpenVPN which is great.\r\nWhat I dislike about expressvpn is that it loses connection fairly often and because the official Windows client doesn't have a kill-switch featurethis is a privacy risk. The Windows client does it's job well, but it does have some annoying bugs (easy fixable though). And most of the time my upload speed is extremely low while connected to a VPN server, I'm not sure what the problem is but I'm thinking that the built-in NAT firewall is causing this.\r\nhttp://www.expressvpnreviewz.com/", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=2", "rating": "5.0", "review_title": "“My Experiance about ExpressVPN through mostsecurevpn.com”", "reviewed_at": "04/06/2015", "reviewer_name": "Mark S.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Torrenting and many other website are blocked in my country. I was very keen to know how I can unblock all these websites on my PC. It took 2 days to find the reliable and secure VPN to all these stuff, and I found Expressvpn on most secure vpn . com and all the described features on that website were same when I came accross to use its services. Great services", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "0.0", "review_title": "“Their software screwed up my computer”", "reviewed_at": "17/03/2015", "reviewer_name": "Mike L.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Now I cannot connect to the internet, no matter the browser or no matter how many times I reboot computer and router/modem.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "3.5", "review_title": "“I found ExpressVPN through vpnexpress.net and have...”", "reviewed_at": "08/10/2013", "reviewer_name": "Lawrence P.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I found ExpressVPN through vpnexpress.net and have been using them for about 7 months. They have added new servers since I started, and I always get good speeds. Their customer service is also fast and helpful.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "4.1", "review_title": "“As an American in China I was constantly frustrated...”", "reviewed_at": "09/07/2013", "reviewer_name": "Grayce G.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "As an American in China I was constantly frustrated by the great fire wall for even the most innocuous sites like Yahoo. When I started looking for a VPN, I found I could not even access the 5 or 6 top rated ones so I just kept searching.  After trying two other companies with problematic download issues, I came across ExpressVPN and no more problems. Download and set up was fast and simple, they have more than enough servers to carry the load. Even when they have switched me to a different server, the transition is seamless, I couldn't tell the server had been switched until I was logging off their connection. Customer Service response must be the fastest in the business. I cannot recommend this VPN highly enough.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "3.7", "review_title": "“Have used ExpressVPN in China for 2 months where many...”", "reviewed_at": "22/06/2013", "reviewer_name": "Mel T.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Have used ExpressVPN in China for 2 months where many sites were blocked to be prior to ExpressVPN. The only downside is that one of my Email sites blocks access (@cantab.net) so I have to close ExpressVPN to send email from that one account.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "3.5", "review_title": "“This is a very popular VPN service”", "reviewed_at": "03/09/2010", "reviewer_name": "Tyler B.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "This is a very popular VPN service. My friend recommended it to me for getting to blocked websites and extra privacy while surfing. I found their support team to be excellent, cause they responded to my email within 30 minutes and helped me to get everything working correctly. The performance is actually very good compared to other VPNs I tried in the past. It did not slow my browsing speeds at all. I do recommend this site highly!", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "3.8", "review_title": "“Awesome VPN service”", "reviewed_at": "31/08/2010", "reviewer_name": "Ted P.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Awesome VPN service.  Fast, secure and safe.  I have been a member for 8 months now and love the service.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "3.9", "review_title": "“Promised support within 24 hours”", "reviewed_at": "16/08/2010", "reviewer_name": "yun y.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "Promised support within 24 hours.  Its 30 hours now , and no resolution.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "0.0", "review_title": "“I used ExpressVPN on my last business trip to  Shanghai”", "reviewed_at": "25/04/2010", "reviewer_name": "Michael V.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "I used ExpressVPN on my last business trip to  Shanghai. It worked pretty fast, and their support guy was very friendly.", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}, {"absolute_url": "https://www.sitejabber.com/reviews/expressvpn.com?page=3", "rating": "1.0", "review_title": "“This company is a scam”", "reviewed_at": "17/03/2010", "reviewer_name": "Brady P.", "category": "Hosting Service", "service_name": "Bluehost", "review_text": "This company is a scam.\r\n\r\nThey charged my credit card without authorization.  Told me my card had been \"phished\" and they would issue an immediate refund.\r\n\r\nI then asked them for the email address and ip address of the person that made the charge.  No response.  After 5 request with NO response, they finally responded and now say, they have no record of a charge to me at all.  Interesting how before i requested some basic info that any reputable site would have, they found me and where issuing a full refund, only to then not be able to find me...", "picture_urls": null, "website_name": ["Sitejabber Online Business Reviews and Complaints"]}]}]}]}